Repository: itbakery/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: kk_kz

source: OK
kk_kz: ОК

source: Cancel
kk_kz: Болдырмау

source: This link will open in a new browser window/tab
kk_kz: Осы сілтеме жаңа терезеде немесе браузердің жаңа қойындысында ашылады

source: Show Annotations
kk_kz: Түсініктемелерді көрсету

source: Hide Annotations
kk_kz: Аннотацияларды жасыру

source: Expand Instructions
kk_kz: Нұсқаулықтарды ашу

source: Collapse Instructions
kk_kz: Нұсқаулықтарды жинақтау

source: Commentary
kk_kz: Түсіндірмелер

source: Reply to Annotation
kk_kz: Түсініктемелерге жауап беру

source: (%(earned)s/%(possible)s point)
kk_kz: (%(earned)s/%(possible)s балл)

source: (%(num_points)s point possible)
kk_kz: (%(num_points)s мүмкін болатын балл)

source: Answer:
kk_kz: Жауап:

source: Hide Answer
kk_kz: Жауапты жасыру

source: Show Answer
kk_kz: Жауапты көрсету

source: Reveal Answer
kk_kz: Жауапты ашу

source: Answer hidden
kk_kz: Жауап жасырылды

source: unanswered
kk_kz: Жауап жоқ

source: Status: unsubmitted
kk_kz: Мәртебесі: тексерілмеген

source: You need to pick a rating before you can submit.
kk_kz: Сіз жалғастырмастан бұрын рейтингті көрсетуіңіз керек

source: Your score did not meet the criteria to move to the next step.
kk_kz: Сіздің бағаңыз келесі қадамға өту өлшемдерін қанағаттандырмайды

source: Submit
kk_kz: Жөнелту

source: Submit assessment
kk_kz: Бағаны жөнелту

source: Your response has been submitted. Please check back later for your grade.
kk_kz: Сіздің жауабыңыз қабылданды. Өз бағаңызды білу үшін осы бетке кейінірек оралыңыз.

source: Submit post-assessment
kk_kz: Сіздің бағаңыздың рейтингін жөнелту

source: Answer saved, but not yet submitted.
kk_kz: Жауап сақталды, бірақ әлі тексеруге тапсырылған жоқ.

source: Please confirm that you wish to submit your work. You will not be able to make any changes after submitting.
kk_kz: Сіз жұмысыңызды жөнелткіңіз келетіндігіңізді растаңыз. Жөнелткеннен кейін сіз ешқанда түзетулер енгізе алмайсыз.

source: You are trying to upload a file that is too large for our system. Please choose a file under 2MB or paste a link to it into the answer box.
kk_kz: Сіз тым үлкен файлды жүктегіңіз келеді. Мөлшері 2МБ кем файлды таңдаңыз немесе енгізу алабында оған сілтемені көрсетіңіз.

source: Are you sure you want to remove your previous response to this question?
kk_kz: Сіз осы сұраққа берген алдыңғы жауабыңызды шынымен де жойғыңыз келе ме?

source: Moved to next step.
kk_kz: Келесі қадамға ауыстырылды.

source: File uploads are required for this question, but are not supported in your browser. Try the newest version of Google Chrome. Alternatively, if you have uploaded the image to another website, you can paste a link to it into the answer box.
kk_kz: Осы сұрақ үшін файлдарды жүктеу қажет, бірақ сіздің браузер оны қолдамайды. Google Chrome соңғы нұсқасын қолданып көріңіз. Балама ретінде сіз бейнелерді бөгде сайтқа жүктей және жауап алабында сілтемені кірістіре аласыз.

source: Show Question
kk_kz: Сұрақты көрсету

source: Hide Question
kk_kz: Жауапты жасыру

source: Sequence error! Cannot navigate to tab %(tab_name)s in the current SequenceModule. Please contact the course staff.
kk_kz: Дәйектілік қатесі! Ағымдағы дәйектілік модулінде %(tab_name)s бетбелгісіне өту мүмкін емес. Оқу корпусының қызметкерлеріне жүгініңіз.

source: Video slider
kk_kz: Бейнені қайта айналдыру

source: Pause
kk_kz: Іркіліс

source: Play
kk_kz: Қалпына келтіру

source: Fill browser
kk_kz: Браузердің өлшемдерін үйлестіру

source: Exit full browser
kk_kz: Толық экранды режимнен шығу

source: HD on
kk_kz: HD қосылған

source: HD off
kk_kz: HD ажыратылған

source: Video position
kk_kz: Бейне тұғыры

source: Video ended
kk_kz: Бейнені көрсетуге тыйым салынады

source: %(value)s hour
kk_kz: %(value)s сағаттар

source: %(value)s minute
kk_kz: %(value)s минуттар

source: %(value)s second
kk_kz: %(value)s секундтар

source: Volume
kk_kz: Дыбыс

source: Muted
kk_kz: Дыбыссыз

source: Very low
kk_kz: Өте тыныш

source: Low
kk_kz: Тыныш

source: Average
kk_kz: Орташа дыбыс

source: Loud
kk_kz: Қатты дыбыс

source: Very loud
kk_kz: Өте қатты дыбыс

source: Maximum
kk_kz: Ең жоғары дыбыс

source: Caption will be displayed when
kk_kz: Тақырыптар мынадай жағдайда бейнеленетін болады

source: Turn on captions
kk_kz: Тақырыптарды қосу

source: Turn off captions
kk_kz: Тақырыптарды ажырату

source: Hide Discussion
kk_kz: Талқылауды жасыру

source: Show Discussion
kk_kz: Талқылауды көрсету

source: Sorry
kk_kz: Кешіріңіз

source: We had some trouble loading the discussion. Please try again.
kk_kz: Талқылауды жүктеу кезінде проблема туындады. Тағы бір рет әрекет етіп көріңіз.

source: We had some trouble loading the threads you requested. Please try again.
kk_kz: Сіз сұрау салған тақырыптарды жүктеу кезінде проблема туындады. Тағы бір рет әрекет етіп көріңіз.

source: Loading content
kk_kz: Мазмұнын жүктеу

source: We had some trouble processing your request. Please ensure you have copied any unsaved work and then reload the page.
kk_kz: Сіздің сауалды өңдеу кезінде проблема туындады. Өзіңіздің сақталмаған жұмысыңызды көшіріп алыңыз және бетті қайта жүктеңіз.

source: We had some trouble processing your request. Please try again.
kk_kz: Сіздің сауалды орындау кезінде проблема туындады. Тағы бір рет әрекет етіп көріңіз.

source: Close
kk_kz: Жабу

source: Open
kk_kz: Ашу

source: remove vote
kk_kz: Дауысты жою

source: vote
kk_kz: дауыс беру

source: vote (click to vote)
kk_kz: дауыстар (дауыс беру үшін басыңыз)

source: Load more
kk_kz: Тақырыптарды жүктеу

source: Loading more threads
kk_kz: Қосымша тақырыптарды жүктеу

source: We had some trouble loading more threads. Please try again.
kk_kz: Қосымша тақырыптарды жүктеу кезінде проблема туындады. Тағы бір рет әрекет етіп көріңіз.

source: %(unread_count)s new comment
kk_kz: %(unread_count)s жаңа түсіндірмелер

source: Loading thread list
kk_kz: Тақырыптар тізімі жүктелуде

source: Click to remove report
kk_kz: Есепті жою үшін шертіңіз

source: Misuse Reported%(start_sr_span)s, click to remove report%(end_span)s
kk_kz: Қате пайдалану туралы хабар%(start_sr_span)s, хабарды алып тастау үшін шертіңіз%(end_span)s

source: Report Misuse
kk_kz: Қате пайдалану туралы хабарлаңыз

source: Pinned%(start_sr_span)s, click to unpin%(end_span)s
kk_kz: Бекітілді%(start_sr_span)s, бекітуді болдырмау үшін басыңыз%(end_span)s

source: Click to unpin
kk_kz: Бекітуді алып тастау үшін шертіңіз

source: Pinned
kk_kz: Бекітілді

source: Pin Thread
kk_kz: Тақырыпты бекіту

source: The thread you selected has been deleted. Please select another thread.
kk_kz: Сіз таңдаған тақырып жойылған болатын. Басқа тақырыпты таңдаңыз.

source: We had some trouble loading responses. Please reload the page.
kk_kz: Жауаптарды жүктеу кезінде проблема туындады. Бетті қайта жүктеңіз.

source: We had some trouble loading more responses. Please try again.
kk_kz: Қосымша жауаптарды жүктеу кезінде проблема туындады. Тағы бір рет әрекет етіп көріңіз.

source: %(numResponses)s response
kk_kz: %(numResponses)s жауаптар

source: Showing all responses
kk_kz: Барлық жауаптар бейнеленген

source: Showing first response
kk_kz: Бірінші %(numResponses)s жауаптар бейнеленген

source: Load all responses
kk_kz: Барлық жауаптарды жүктеу

source: Load next %(numResponses)s responses
kk_kz: Мынадай %(numResponses)s жауаптарды жүктеу

source: Are you sure you want to delete this post?
kk_kz: Сіз осы хабарды шынымен жойғыңыз келе ме?

source: anonymous
kk_kz: аноним

source: staff
kk_kz: қызметкер

source: Community TA
kk_kz: Қоғамдастықтың техникалық ассистенті

source: Misuse Reported, click to remove report
kk_kz: Қате пайдалану туралы хабар алынды, оны жою үшін шертіңіз

source: Are you sure you want to delete this comment?
kk_kz: Сіз осы түсіндірмені шынымен жойғыңыз келе ме?

source: We had some trouble deleting this comment. Please try again.
kk_kz: Осы түсіндірмені жою кезінде проблема туындады. Тағы бір рет әрекет етіп көріңіз.

source: Are you sure you want to delete this response?
kk_kz: Сіз осы түсіндірмені шынымен жойғыңыз келе ме?

source: %s ago
kk_kz: %s кері қарай

source: %s from now
kk_kz: %s кейін

source: less than a minute
kk_kz: бір минуттан кем

source: about a minute
kk_kz: шамамен бір минут

source: %d minute
kk_kz: %d минут

source: about an hour
kk_kz: шамамен бір сағат

source: about %d hour
kk_kz: шамамен %d сағат

source: a day
kk_kz: бір күні

source: %d day
kk_kz: %d күндер

source: about a month
kk_kz: шамамен бір ай

source: %d month
kk_kz: %d айлар

source: about a year
kk_kz: шамамен бір жыл

source: %d year
kk_kz: %d жылдар

source: Available %s
kk_kz: Қол жетімді %s

source: This is the list of available %s. You may choose some by selecting them in the box below and then clicking the "Choose" arrow between the two boxes.
kk_kz: Бұл қол жетімді %s тізімі. Сіз төмендегі алапта бөлектеп көрсетілген тақырыптарды таңдай, сонан соң екі алап арасындағы \"Таңдау\" нұсқамасын шерте аласыз.

source: Type into this box to filter down the list of available %s.
kk_kz: Төменде қол жетімді %s сүзгісі пайда болу үшін осы алапта мәнді енгізіңіз.

source: Filter
kk_kz: Сүзгі

source: Choose all
kk_kz: Барлығын таңдау

source: Click to choose all %s at once.
kk_kz: Барлық %s бір рет таңдау үшін шертіңіз.

source: Choose
kk_kz: Таңдау

source: Remove
kk_kz: Жою

source: Chosen %s
kk_kz: %s таңдалды

source: This is the list of chosen %s. You may remove some by selecting them in the box below and then clicking the "Remove" arrow between the two boxes.
kk_kz: Бұл таңдалған %s тізімі. Сіз төмендегі алапта бөлектеп көрсетілген тақырыптарды таңдай, сонан соң екі алап арасындағы \"Жою\" нұсқамасын шерте аласыз.

source: Remove all
kk_kz: Барлығын жою

source: Click to remove all chosen %s at once.
kk_kz: Барлық %s бір рет жою үшін шертіңіз.

source: %(sel)s of %(cnt)s selected
kk_kz: %(cnt)s таңдалғандардан %(sel)s

source: You have unsaved changes on individual editable fields. If you run an action, your unsaved changes will be lost.
kk_kz: Сіз жекелеген алаптарда өзгерістерді сақтамадыңыз. Егер сіз әрекет ете бастасаңыз, сіздің сақталмаған өзгерістеріңіз жоғалатын болады.

source: You have selected an action, but you haven't saved your changes to individual fields yet. Please click OK to save. You'll need to re-run the action.
kk_kz: Сіз әрекетті таңдадыңыз, бірақ өз өзгерістеріңізді жекелеген алаптарда әлі сақтаған жоқсыз. Сақтау үшін ОК шертіңіз. Сонда сізге әрекетті қайта іске қосу қажет болады.

source: You have selected an action, and you haven't made any changes on individual fields. You're probably looking for the Go button rather than the Save button.
kk_kz: Сіз әрекетті таңдадыңыз және жекелеген алаптарда ешқандай өзгерістер жасамадыңыз. СІЗ \"Сақтау\" батырмасын емес \"Бастау\" батырмасын іздеген боларсыз.

source: January|February|March|April|May|June|July|August|September|October|November|December
kk_kz: Қаңтар|Ақпан|Наурыз|Сәуір|Мамыр|Мау сым|Шілде|Тамыз|Қыркүйек|Қазан|Қараша|Желтоқсан

source: S|M|T|W|T|F|S
kk_kz: Ж|Д|С|С|Б|Ж|С

source: Show
kk_kz: Көрсету

source: Hide
kk_kz: Жасыру

source: Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday
kk_kz: Жексенбі|Дүйсенбі|Сейсенбі|Сәрсенбі|Бейсенбі|Жұма|Сенбі

source: Now
kk_kz: Қазір

source: Clock
kk_kz: Сағаттар

source: Choose a time
kk_kz: Уақытты таңдау

source: Midnight
kk_kz: Түн ортасы

source: Noon
kk_kz: Талтүс

source: Today
kk_kz: Бүгін

source: Calendar
kk_kz: Күнтізбе

source: Yesterday
kk_kz: Кеше

source: Tomorrow
kk_kz: Ертең

source: Open Calculator
kk_kz: Калькуляторды ашу

source: Close Calculator
kk_kz: Калькуляторды жабу

source: Preview
kk_kz: Алдын ала қарау

source: Post body
kk_kz: Хабар мәтіні

source: Error fetching distribution.
kk_kz: Бөліп тарату деректерін жүктеу қатесі.

source: Unavailable metric display.
kk_kz: Деректерді бейнелеу қол жетімді емес.

source: Error fetching grade distributions.
kk_kz: Сыныптар бойынша бөліп тарату деректерін жүктеу қателігі.

source: Last Updated: <%= timestamp %>
kk_kz: Соңғы жаңарту: <%= timestamp %>

source: <%= num_students %> students scored.
kk_kz: <%= num_students %> студенттер бағаланды.

source: Loading...
kk_kz: Жүктеу жүргізілуде...

source: Error getting student list.
kk_kz: Оқытылушылар тізімін алу қатесі.

source: Error retrieving grading configuration.
kk_kz: Бағалау үшін конфигурацияны алу қатесі.

source: Error generating grades. Please try again.
kk_kz: Бағалау есебінің қатесі. Тағы бір рет әрекет етіп көріңіз.

source: File Name
kk_kz: Файлдың атауы

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
kk_kz: Сілтемелер талап бойынша құрылады және студенттер ұсынған ақпараттың әдептілігіне байланысты 5 минут ішінде жоғалады.

source: Username
kk_kz: Пайдаланушының аты

source: Email
kk_kz: Электрондық почта

source: Revoke access
kk_kz: Қол жеткізуді болдырмау

source: Enter username or email
kk_kz: Пайдаланушының атын немесе электрондық мекенжайды енгізіңіз

source: Please enter a username or email.
kk_kz: Өтінеміз, пайдаланушының атын немесе электрондық мекенжайды енгізіңіз

source: Error fetching list for role
kk_kz: Рөлге арналған тізімді енгізу қатесі

source: Error changing user's permissions.
kk_kz: Пайдаланушының өкілеттіктерін өзгерту қатесі

source: Could not find a user with username or email address '<%= identifier %>'.
kk_kz: Пайдаланушы аты немесе '<%= identifier %>' электрондық мекенжайы бар пайдаланушыны табуға мүмкіндік болмады.

source: Error: User '<%= username %>' has not yet activated their account. Users must create and activate their accounts before they can be assigned a role.
kk_kz: Қате: '<%= username %>' пайдаланушы өзінің есептік жазбасын белсендендірген жоқ. Пайдаланушылар оларға қандай да болмасын бір рөл меншіктелместен бұрын өздерінің есептік жазбасын құруы және белсендендіруі тиіс.

source: Error: You cannot remove yourself from the Instructor group!
kk_kz: Қате: Сіз өзіңізді Оқытушылар тобынан жоя алмайсыз!

source: Error adding/removing users as beta testers.
kk_kz: Пайдаланушыларды бета тестерлер ретінде қосу/жою қатесі.

source: These users were successfully added as beta testers:
kk_kz: Мынадай пайдаланушылар бета тестерлер ретінде ойдағыдай қосылған болатын:

source: These users were successfully removed as beta testers:
kk_kz: Мынадай пайдаланушылар үшін бета тестерлер мәртебесі ойдағыдай жойылған болатын:

source: These users were not added as beta testers:
kk_kz: Мынадай пайдаланушылар бета тестерлер ретінде қосылған жоқ:

source: These users were not removed as beta testers:
kk_kz: Мынадай пайдаланушылар үшін бета тестерлер мәртебесі алынып тасталмады:

source: Users must create and activate their account before they can be promoted to beta tester.
kk_kz: Пайдаланушылар оларға бета тестер мәртебесі ұсынылғаннан бұрын өздерінің есептік жазбаларын құруы және белсендендіруі тиіс.

source: Error enrolling/unenrolling users.
kk_kz: Пайдаланушыларды тіркеу/тіркеуді болдырмау кезіндегі қате.

source: The following email addresses and/or usernames are invalid:
kk_kz: Мынадай электрондық почта мекенжайлары және/немесе аттары жарамсыз:

source: Successfully enrolled and sent email to the following users:
kk_kz: Мынадай пайдаланушылар ойдағыдай тіркелді және оларға хаттар жіберілді:

source: Successfully enrolled the following users:
kk_kz: Мынадай пайдаланушылар ойдағыдай тіркелді:

source: Successfully sent enrollment emails to the following users. They will be allowed to enroll once they register:
kk_kz: Мынадай пайдаланушыларға тіркеу туралы электрондық хабарлар ойдағыдай жіберілді. Олар өздерінің есептік жазбаларын құрған бойдан тіркеле алатын болады:

source: These users will be allowed to enroll once they register:
kk_kz: Мынадай пайдаланушылар өздерінің есептік жазбаларын құрған бойдан тіркеле алатын болады:

source: Successfully sent enrollment emails to the following users. They will be enrolled once they register:
kk_kz: Мынадай пайдаланушыларға тіркеу туралы электрондық хабарлар ойдағыдай жіберілді: Олар өздерінің есептік жазбаларын құрған бойдан тіркелетін болады.

source: These users will be enrolled once they register:
kk_kz: Мынадай пайдаланушылар өздерінің есептік жазбаларын құрған бойдан тіркелетін болады.

source: Emails successfully sent. The following users are no longer enrolled in the course:
kk_kz: Электрондық хабарлар жіберілді. Мынадай пайдаланушыларды курста тіркеу болдырмайды:

source: The following users are no longer enrolled in the course:
kk_kz: Мынадай пайдаланушыларды курста тіркеу болдырмайды:

source: These users were not affiliated with the course so could not be unenrolled:
kk_kz: Мынадай пайдаланушылар осы курспен байланысты болмаған және тіркелгендер тізімінен алып тастала алмайды:

source: Your message must have a subject.
kk_kz: Өз хабарыңыздың тақырыбын көрсетіңіз.

source: Your message cannot be blank.
kk_kz: Сіздің хабарыңыз бос бола алмайды.

source: Your email was successfully queued for sending.
kk_kz: Сіздің электрондық хабарыңыз жөнелту кезегіне ойдағыдай қосылды.

source: You are about to send an email titled '<%= subject %>' to yourself. Is this OK?
kk_kz: Сіз '<%= subject %>' тақырыбы бар хабарды өз мекенжайыңызға жөнелтесіз. Жалғастырылсын ба?

source: You are about to send an email titled '<%= subject %>' to everyone who is staff or instructor on this course. Is this OK?
kk_kz: Сіз '<%= subject %>' тақырыбы бар хабарды курстың барлық қызметкерлері мен оқытушыларына жөнелтесіз. Жалғастырылсын ба?

source: You are about to send an email titled '<%= subject %>' to ALL (everyone who is enrolled in this course as student, staff, or instructor). Is this OK?
kk_kz: Сіз '<%= subject %>' тақырыбы бар хабарды БАРЛЫҒЫНА (осы курста студент, қызметкер немесе оқытушы ретінде тіркелгендердің барлығына) жөнелтесіз. Жалғастырылсын ба?

source: Your email was successfully queued for sending. Please note that for large classes, it may take up to an hour (or more, if other courses are simultaneously sending email) to send all emails.
kk_kz: Сіздің электрондық хабарыңыз жөнелту кезегіне ойдағыдай қосылды. Егер сынып үлкен болса, барлық хабарларды жөнелту бір сағатқа дейінгі (немесе егер басқа курстар хабарларды дәл осы уақытта жөнелтсе, одан артық) уақытты алуы мүмкін екендігіне назар аударыңыз

source: Error sending email.
kk_kz: Электрондық хабарды жөнелту кезіндегі қате.

source: There is no email history for this course.
kk_kz: Осы курс үшін электрондық хат алмасу тарихы жоқ.

source: There was an error obtaining email task history for this course.
kk_kz: Осы курс үшін электрондық хат алмасу тарихы жоқ.

source: Please enter a student email address or username.
kk_kz: Студенттің электрондық мекенжайын немесе пайдаланушысының атын енгізіңіз.

source: Error getting student progress url for '<%= student_id %>'. Check that the student identifier is spelled correctly.
kk_kz: '<%= student_id %>' студенттің оқу жай-күйіне url-сілтемелер алу қатесі. Оқушы сәйкестендіргішінің дұрыс жазылуын тексеріңіз.

source: Please enter a problem urlname.
kk_kz: Міндетке url-сілтеменің атауын енгізіңіз.

source: Success! Problem attempts reset for problem '<%= problem_id %>' and student '<%= student_id %>'.
kk_kz: '<%= student_id %>' студент үшін '<%= problem_id %>' тапсырмасын орындау әрекетінің саны ойдағыдай шығарып тасталды.

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%= student_id %>'. Check that the problem and student identifiers are spelled correctly.
kk_kz: '<%= student_id %>' студент үшін '<%= problem_id %>' тапсырмасын орындау әрекетінің санын шығарып тастау кезіндегі қате. Тапсырма және студент сәйкестендіргіштері нің дұрыс жазылуын тексеріңіз.

source: Delete student '<%= student_id %>'s state on problem '<%= problem_id %>'?
kk_kz: '<%= student_id %>' оқушының '<%= problem_id %>' тапсырма бойынша жұмыс мәртебесі жойылсын ба?

source: Error deleting student '<%= student_id %>'s state on problem '<%= problem_id %>'. Check that the problem and student identifiers are spelled correctly.
kk_kz: '<%= student_id %>' оқушының '<%= problem_id %>' тапсырма бойынша жұмыс мәртебесін жою қатесі. Тапсырма және студент сәйкестендіргіштері нің дұрыс жазылуын тексеріңіз.

source: Module state successfully deleted.
kk_kz: Модуль мәртебесі ойдағыдай жойылды.

source: Started rescore problem task for problem '<%= problem_id %>' and student '<%= student_id %>'. Click the 'Show Background Task History for Student' button to see the status of the task.
kk_kz: '<%= problem_id %>' тапсырмасы және '<%= student_id %>' оқушы үшін қайта бағалау міндеті іске қосылды. Міндеттің жай-күйін көру үшін 'Оқушыға арналған фондық міндеттердің тарихын көрсету' батырмасын шертіңіз.

source: Error starting a task to rescore problem '<%= problem_id %>' for student '<%= student_id %>'. Check that the problem and student identifiers are spelled correctly.
kk_kz: '<%= student_id %>' оқушы үшін '<%= problem_id %>' тапсырмасын қайта бағалау бойынша міндетті іске қосу қатесі. Тапсырма және студент сәйкестендіргіштері нің дұрыс жазылуын тексеріңіз.

source: Error getting task history for problem '<%= problem_id %>' and student '<%= student_id %>'. Check that the problem and student identifiers are spelled correctly.
kk_kz: '<%= problem_id %>' тапсырма және '<%= student_id %>' оқушы үшін міндеттер тарихын алу қатесі. Тапсырма және студент сәйкестендіргіштері нің дұрыс жазылуын тексеріңіз.

source: Reset attempts for all students on problem '<%= problem_id %>'?
kk_kz: '<%= problem_id %>' тапсырмасын орындау әрекеттерінің саны барлық студенттер үшін шығарып тасталсын ба?

source: Successfully started task to reset attempts for problem '<%= problem_id %>'. Click the 'Show Background Task History for Problem' button to see the status of the task.
kk_kz: '<%= problem_id %>' тапсырмасын орындау әрекеттерінің санын шығарып тастап жөніндегі міндет ойдағыдай іске қосылды. Міндеттің орындалу мәртебесін қарау үшін 'Тапсырмаға арналған фондық міндеттердің тарихын көрсету' батырмасын шертіңіз.

source: Error starting a task to reset attempts for all students on problem '<%= problem_id %>'. Check that the problem identifier is spelled correctly.
kk_kz: '<%= problem_id %>' тапсырмасы үшін барлық студенттердің әрекеттерін шығарып тастау жөніндегі міндетті іске қосу қатесі. Тапсырма сәйкестендіргішінің дұрыс жазылғандығына көз жеткізіңіз.

source: Rescore problem '<%= problem_id %>' for all students?
kk_kz: Барлық студенттер үшін '<%= problem_id %>' тапсырмасы қайта бағалансын ба?

source: Successfully started task to rescore problem '<%= problem_id %>' for all students. Click the 'Show Background Task History for Problem' button to see the status of the task.
kk_kz: Барлық студенттер үшін '<%= problem_id %>' тапсырмасын қайта бағалау міндеті ойдағыдай іске қосылды. Міндеттің мәртебесін көру үшін 'Оқушыға арналған фондық міндеттердің тарихын көрсету' батырмасын шертіңіз.

source: Error starting a task to rescore problem '<%= problem_id %>'. Check that the problem identifier is spelled correctly.
kk_kz: '<%= problem_id %>' тапсырмасын қайта бағалау міндетін іске қосу қатесі. Тапсырма сәйкестендіргішінің дұрыс жазылғандығына көз жеткізіңіз.

source: Error listing task history for this student and problem.
kk_kz: Осы студент пен тапсырма үшін тарихты шығару міндетінің қатесі.

source: Task Type
kk_kz: Тапсырма үлгісі

source: Task inputs
kk_kz: Тапсырманы енгізу

source: Task ID
kk_kz: Тапсырма ID

source: Requester
kk_kz: Сұрау салушы

source: Submitted
kk_kz: Қарау үшін салынғаны

source: Duration (sec)
kk_kz: Ұзақтығы (сек)

source: State
kk_kz: Жай-күйі

source: Task Status
kk_kz: Тапсырманың жай-күйі

source: Task Progress
kk_kz: Тапсырманың алға басуы

source: Grades saved. Fetching the next submission to grade.
kk_kz: Бағалар сақталды. Бағаға келесі жауап жүктелуде.

source: Problem Name
kk_kz: Міндеттің аты

source: Graded
kk_kz: Бағаланды
