Repository: itbakery/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: kk_kz

source: Available to Grade
kk_kz: Бағалау қою үшін қол жетімді

source: Required
kk_kz: Талап етіледі

source: Progress
kk_kz: Алға басу

source: Back to problem list
kk_kz: Тапсырмалар тізіміне қайта оралу

source: Try loading again
kk_kz: Қайта жүктеу

source: <%= num %> available
kk_kz: <%= num %> қол жетімді

source: <%= num %> graded
kk_kz: <%= num %> бағаланды

source: <%= num %> more needed to start ML
kk_kz: ML іске қосу үшін <%= num %> артығы қажет

source: Re-check for submissions
kk_kz: Өтінімдерді қайта тексеріңіз

source: System got into invalid state: <%= state %>
kk_kz: Жүйедегі ақау: <%= state %>

source: System got into invalid state for submission:
kk_kz: Жүйе мынадай өтінім себебінен жарамсыз жай-күйде:

source: (Hide)
kk_kz: (Жасыру)

source: (Show)
kk_kz: (Көрсету)

source: Insert Hyperlink
kk_kz: Сілтемені кірістіру

source: "optional title"
kk_kz: "міндетті емес тақырып"

source: Insert Image (upload file or type url)
kk_kz: Бейнені кірістіру (URL жүктеу немесе көрсету)

source: Markdown Editing Help
kk_kz: Маркдаун Редакциялаудағы көмек

source: Bold (Ctrl+B)
kk_kz: Қара жалпақ (Ctrl+B)

source: Italic (Ctrl+I)
kk_kz: Курсив (Ctrl+I)

source: Hyperlink (Ctrl+L)
kk_kz: Гиперсілтеме (Ctrl+L)

source: Blockquote (Ctrl+Q)
kk_kz: Дәйексөз (Ctrl+Q)

source: Code Sample (Ctrl+K)
kk_kz: Бағдарламалық Код (Ctrl+K)

source: Image (Ctrl+G)
kk_kz: Бейне (Ctrl+G)

source: Numbered List (Ctrl+O)
kk_kz: Нөмірленген Тізім (Ctrl+O)

source: Bulleted List (Ctrl+U)
kk_kz: Таңбаланған Тізім (Ctrl+U)

source: Heading (Ctrl+H)
kk_kz: Тақырып (Ctrl+H)

source: Horizontal Rule (Ctrl+R)
kk_kz: Көлденең Сызық (Ctrl+R)

source: Undo (Ctrl+Z)
kk_kz: Болдырмау (Ctrl+Z)

source: Redo (Ctrl+Y)
kk_kz: Қайталау (Ctrl+Y)

source: Redo (Ctrl+Shift+Z)
kk_kz: Қайталау (Ctrl+Shift+Z)

source: strong text
kk_kz: қара жалпақ қаріппен мәтін

source: emphasized text
kk_kz: курсивпен мәтін

source: enter image description here
kk_kz: бейне сипаттамасын енгізіңіз

source: enter link description here
kk_kz: сілтеме сипаттамасын енгізіңіз

source: Blockquote
kk_kz: Дәйексөз

source: enter code here
kk_kz: бағдарламалық кодты енгізіңіз

source: List item
kk_kz: Тізім тармағы

source: Heading
kk_kz: Тақырып

source: Unable to retrieve data, please try again later.
kk_kz: Деректер алуға мүмкіндік болмады. Кейінірек қайталауға әрекет етіп көріңіз.

source: Number of Students
kk_kz: Студенттер саны

source: or
kk_kz: әлде

source: Delete
kk_kz: Алып тастау

source: Name
kk_kz: Аты

source: Upload File
kk_kz: Файлды жүктеу

source: Editor
kk_kz: Редактор

source: Settings
kk_kz: Күйге келтіру

source: Save
kk_kz: Сақтау
